PCB = [{"进程名":'P1', "到达时间":5, "运行时间":5, "已用CPU时间":0, "进程状态":'W'},\
        {"进程名":'P2', "到达时间":3, "运行时间":5, "已用CPU时间":0, "进程状态":'W'},\
        {"进程名":'P3', "到达时间":7, "运行时间":5, "已用CPU时间":0, "进程状态":'W'},\
        {"进程名":'P4', "到达时间":6, "运行时间":5, "已用CPU时间":0, "进程状态":'W'},\
        {"进程名":'P5', "到达时间":1, "运行时间":5, "已用CPU时间":0, "进程状态":'W'}]
def key(n):
    if n == 5:
        k = [[], [], [], [], []]
    elif n == 4:
        k = [[], [], [], []]
    elif n == 3:
        k = [[], [], []]
    elif n == 2:
        k = [[], []]
    else:
        k = [[]]
    for i in range(len(k)):
        k[i] = PCB[i]["到达时间"] 
    q = k.index(min(k))
    PCB[q]["进程状态"] = 'R'
    PCB[q]["已用CPU时间"] = PCB[q]["运行时间"]
    print("***运行进程***")
    print(PCB[q])
    print("***就绪队列***")
    for i in range(len(k)):
        if len(k) == 1:
            print("      无")
        if i == q:
            pass
        else:
            print(PCB[i])
    print("***阻塞队列***\n      无\n")
    del PCB[q]
print("-----------------------基于先来先服务的调度算法-----------------------\n")
for i in range(5, 0, -1):
    print("*******第%d次进程调度*******"%(6-i))
    key(i)